test/good/div-before-mul.dot
digraph "div-before-mul" {
    node [shape=box];
    subgraph "cluster_test1" {
        label="test1";
        "test1_143" [label="let a: Int = 10"];
        "test1_144" [label="let b: Int = 3"];
        "test1_146" [label="let c: Int = 2"];
        "test1_148" [label="let result: Int = a / b * c"];
        "test1_150" [label="return result",style=filled,fillcolor="#66A7DB"];
        "test1_143" -> "test1_144";
        "test1_144" -> "test1_146";
        "test1_146" -> "test1_148";
        "test1_148" -> "test1_150";
    }
    subgraph "cluster_test2" {
        label="test2";
        "test2_152" [label="let a: Int = 10"];
        "test2_153" [label="let b: Int = 3"];
        "test2_155" [label="let c: Int = 2"];
        "test2_157" [label="let result: Int = a * c / b"];
        "test2_159" [label="return result",style=filled,fillcolor="#66A7DB"];
        "test2_152" -> "test2_153";
        "test2_153" -> "test2_155";
        "test2_155" -> "test2_157";
        "test2_157" -> "test2_159";
    }
    subgraph "cluster_test3" {
        label="test3";
        "test3_161" [label="let a: Int = 10 / 3"];
        "test3_162" [label="let c: Int = 2"];
        "test3_164" [label="let taintedWithA1: Int = 2 - a"];
        "test3_166" [label="let taintedWithA2: Int = 55 + taintedWithA1"];
        "test3_168" [label="let result: Int = taintedWithA2 * c"];
        "test3_170" [label="return result",style=filled,fillcolor="#66A7DB"];
        "test3_161" -> "test3_162";
        "test3_162" -> "test3_164";
        "test3_164" -> "test3_166";
        "test3_166" -> "test3_168";
        "test3_168" -> "test3_170";
    }
}
