test/good/div-before-mul.mmd
graph TD
subgraph test1
    test1_143["let a: Int = 10"]
    test1_144["let b: Int = 3"]
    test1_146["let c: Int = 2"]
    test1_148["let result: Int = a / b * c"]
    test1_150["return result"]:::exitNode
    test1_143 --> test1_144
    test1_144 --> test1_146
    test1_146 --> test1_148
    test1_148 --> test1_150
end
subgraph test2
    test2_152["let a: Int = 10"]
    test2_153["let b: Int = 3"]
    test2_155["let c: Int = 2"]
    test2_157["let result: Int = a * c / b"]
    test2_159["return result"]:::exitNode
    test2_152 --> test2_153
    test2_153 --> test2_155
    test2_155 --> test2_157
    test2_157 --> test2_159
end
subgraph test3
    test3_161["let a: Int = 10 / 3"]
    test3_162["let c: Int = 2"]
    test3_164["let taintedWithA1: Int = 2 - a"]
    test3_166["let taintedWithA2: Int = 55 + taintedWithA1"]
    test3_168["let result: Int = taintedWithA2 * c"]
    test3_170["return result"]:::exitNode
    test3_161 --> test3_162
    test3_162 --> test3_164
    test3_164 --> test3_166
    test3_166 --> test3_168
    test3_168 --> test3_170
end
